#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.assume_by_codedeploy: Reading...
aws_codedeploy_app.application_main: Refreshing state... [id=b326775b-2c4f-418c-afe6-c643eafbbc4b:app-6]
data.aws_ssm_parameter.infra_output: Reading...
data.aws_caller_identity.current: Reading...
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=app-6-task-execution-role]
data.aws_iam_policy_document.assume_by_codedeploy: Read complete after 0s [id=4250039221]
aws_iam_role.codedeploy: Refreshing state... [id=app-6-code-deploy-role]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_iam_role.ecs_task_role: Refreshing state... [id=app-6-task-role]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-6-task-execution-role-20241003153209502800000001]
data.aws_iam_policy_document.codedeploy: Reading...
data.aws_iam_policy_document.codedeploy: Read complete after 0s [id=1211725747]
data.aws_ssm_parameter.infra_output: Read complete after 0s [id=/app-6/output]
aws_iam_policy.secrets_manager_read_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-6-ecs-fargate-secrets-manager-access]
aws_ecs_task_definition.web_app: Refreshing state... [id=app-6]
aws_iam_role_policy.codedeploy: Refreshing state... [id=app-6-code-deploy-role:terraform-20241003165455650800000001]
aws_iam_role_policy_attachment.attach_secrets_read_task_execution_role: Refreshing state... [id=app-6-task-execution-role-20241003153209508300000002]
aws_iam_role_policy_attachment.attach_secrets_read_task_role: Refreshing state... [id=app-6-task-role-20241003153209524100000003]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:service/app-6/app-6]
aws_codedeploy_deployment_group.application_main: Refreshing state... [id=664c9ff4-b726-4afb-9654-85030ab22491]
local_file.code_deploy_sh: Refreshing state... [id=48210556e9207a31308352e0d6242426ca43da31]
terraform_data.code_deploy: Refreshing state... [id=5100f43c-a2dd-6ce8-d558-9d32fd6f81fd]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # local_file.code_deploy_sh has been deleted
  - resource "local_file" "code_deploy_sh" {
      - content              = <<-EOT
            #!/bin/bash
            echo "Starting CodeDeploy agent deployment"
            ID=$(aws deploy create-deployment \
                --application-name app-6 \
                --deployment-config-name CodeDeployDefault.OneAtATime \
                --deployment-group-name app-6-deploy-group \
                --revision '{"revisionType":"AppSpecContent","appSpecContent":{"content":"'{\"Resources\":[{\"TargetService\":{\"Properties\":{\"LoadBalancerInfo\":{\"ContainerName\":\"first\",\"ContainerPort\":8080},\"TaskDefinition\":\"arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:35\"},\"Type\":\"AWS::ECS::Service\"}}],\"version\":0}'","sha256":"'62b8f57d8c6e0d02431688eab5f4d31b0d4ed405a616007d61e9e089f03f69ef'"}}' \
                --description "Deployment from Terraform" \
                --output json | jq -r '.deploymentId')
            
            echo "waiting for deployment to complete"
            STATUS=$(aws deploy get-deployment \
              --deployment-id "$ID" \
              --output json | jq -r '.deploymentInfo.status')
            
            while [ "$STATUS" == "Created" ] || [ "$STATUS" == "InProgress" ] || [ "$STATUS" == "Pending" ] || [ "$STATUS" == "Queued" ] || [ "$STATUS" == "Ready" ]; do
                echo "Deployment status: $STATUS"
                STATUS=$(aws deploy get-deployment \
                    --deployment-id "$ID" \
                    --output json | jq -r '.deploymentInfo.status')
                echo "waiting for 30 seconds."
                sleep 30
            done
            
            if [ "$STATUS" == "Succeeded" ]; then
                echo "Deployment $ID succeeded"
            else
                echo "Deployment $ID failed"
                exit 1
            fi
        EOT -> null
      - content_base64sha256 = "QUg1fbZf+5OHZU75cCBTcn8Fx/VdDsn1tvJKKp8h2cM=" -> null
      - content_base64sha512 = "5LvAHAbm7HE3wpoo4kj2oDxny2GWfesqlORGbP/NKr5US5dA+nPZ/mBpYRBVCH0g+kXSgjeKE0MEIZ3G4DoG1A==" -> null
      - content_md5          = "4fe9da105a23406ed20ef2d06937924e" -> null
      - content_sha1         = "48210556e9207a31308352e0d6242426ca43da31" -> null
      - content_sha256       = "4148357db65ffb9387654ef9702053727f05c7f55d0ec9f5b6f24a2a9f21d9c3" -> null
      - content_sha512       = "e4bbc01c06e6ec7137c29a28e248f6a03c67cb61967deb2a94e4466cffcd2abe544b9740fa73d9fe6069611055087d20fa45d282378a134304219dc6e03a06d4" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "./code_deploy.sh" -> null
      - id                   = "48210556e9207a31308352e0d6242426ca43da31" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.web_app must be replaced
-/+ resource "aws_ecs_task_definition" "web_app" {
      ~ arn                      = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:35" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "app-6" -> (known after apply)
      ~ revision                 = 35 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # local_file.code_deploy_sh will be created
  + resource "local_file" "code_deploy_sh" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./code_deploy.sh"
      + id                   = (known after apply)
    }

  # terraform_data.code_deploy is tainted, so must be replaced
-/+ resource "terraform_data" "code_deploy" {
      ~ id               = "5100f43c-a2dd-6ce8-d558-9d32fd6f81fd" -> (known after apply)
      ~ input            = "62b8f57d8c6e0d02431688eab5f4d31b0d4ed405a616007d61e9e089f03f69ef" -> (known after apply)
      ~ output           = "62b8f57d8c6e0d02431688eab5f4d31b0d4ed405a616007d61e9e089f03f69ef" -> (known after apply)
      ~ triggers_replace = {
          ~ content              = <<-EOT
                #!/bin/bash
                echo "Starting CodeDeploy agent deployment"
                ID=$(aws deploy create-deployment \
                    --application-name app-6 \
                    --deployment-config-name CodeDeployDefault.OneAtATime \
                    --deployment-group-name app-6-deploy-group \
                    --revision '{"revisionType":"AppSpecContent","appSpecContent":{"content":"'{\"Resources\":[{\"TargetService\":{\"Properties\":{\"LoadBalancerInfo\":{\"ContainerName\":\"first\",\"ContainerPort\":8080},\"TaskDefinition\":\"arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:35\"},\"Type\":\"AWS::ECS::Service\"}}],\"version\":0}'","sha256":"'62b8f57d8c6e0d02431688eab5f4d31b0d4ed405a616007d61e9e089f03f69ef'"}}' \
                    --description "Deployment from Terraform" \
                    --output json | jq -r '.deploymentId')
                
                echo "waiting for deployment to complete"
                STATUS=$(aws deploy get-deployment \
                  --deployment-id "$ID" \
                  --output json | jq -r '.deploymentInfo.status')
                
                while [ "$STATUS" == "Created" ] || [ "$STATUS" == "InProgress" ] || [ "$STATUS" == "Pending" ] || [ "$STATUS" == "Queued" ] || [ "$STATUS" == "Ready" ]; do
                    echo "Deployment status: $STATUS"
                    STATUS=$(aws deploy get-deployment \
                        --deployment-id "$ID" \
                        --output json | jq -r '.deploymentInfo.status')
                    echo "waiting for 30 seconds."
                    sleep 30
                done
                
                if [ "$STATUS" == "Succeeded" ]; then
                    echo "Deployment $ID succeeded"
                else
                    echo "Deployment $ID failed"
                    exit 1
                fi
            EOT -> (known after apply)
          ~ content_base64sha256 = "QUg1fbZf+5OHZU75cCBTcn8Fx/VdDsn1tvJKKp8h2cM=" -> (known after apply)
          ~ content_base64sha512 = "5LvAHAbm7HE3wpoo4kj2oDxny2GWfesqlORGbP/NKr5US5dA+nPZ/mBpYRBVCH0g+kXSgjeKE0MEIZ3G4DoG1A==" -> (known after apply)
          ~ content_md5          = "4fe9da105a23406ed20ef2d06937924e" -> (known after apply)
          ~ content_sha1         = "48210556e9207a31308352e0d6242426ca43da31" -> (known after apply)
          ~ content_sha256       = "4148357db65ffb9387654ef9702053727f05c7f55d0ec9f5b6f24a2a9f21d9c3" -> (known after apply)
          ~ content_sha512       = "e4bbc01c06e6ec7137c29a28e248f6a03c67cb61967deb2a94e4466cffcd2abe544b9740fa73d9fe6069611055087d20fa45d282378a134304219dc6e03a06d4" -> (known after apply)
          ~ id                   = "48210556e9207a31308352e0d6242426ca43da31" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*